Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.InheritOffsetsFromPrimary Property
 Gets or sets a value indicating whether the secondary guideline inherits its start and end offsets from the primary guideline. This property is not applicable to a primary guideline.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool InheritOffsetsFromPrimary { get; set; }
Public Property InheritOffsetsFromPrimary As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RebarSpacing Class
Tekla.Structures.Model Namespace